In [5]:
import pandas as pd

df = pd.read_excel("file_example.xls")
print(df)

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [6]:
df[1:4]

   0 First Name  Last Name  Gender        Country  Age        Date    Id
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549

In [7]:
df

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [8]:
df[:]

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [12]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [13]:
df.loc[2]

0                      3
First Name        Philip
Last Name           Gent
Gender              Male
Country           France
Age                   36
Date          21/05/2015
Id                  2587
Name: 2, dtype: object

In [14]:
df.iloc[2]

0                      3
First Name        Philip
Last Name           Gent
Gender              Male
Country           France
Age                   36
Date          21/05/2015
Id                  2587
Name: 2, dtype: object

In [15]:
df.columns

Index([0, 'First Name', 'Last Name', 'Gender', 'Country', 'Age', 'Date', 'Id'], dtype='object')

In [16]:
df['Age']

0    32
1    25
2    36
3    25
4    58
5    24
6    56
7    27
8    40
Name: Age, dtype: int64

In [17]:
df.Age

0    32
1    25
2    36
3    25
4    58
5    24
6    56
7    27
8    40
Name: Age, dtype: int64

In [18]:
df[['Age', 'Date']]

   Age        Date
0   32  15/10/2017
1   25  16/08/2016
2   36  21/05/2015
3   25  15/10/2017
4   58  16/08/2016
5   24  21/05/2015
6   56  15/10/2017
7   27  16/08/2016
8   40  21/05/2015

In [ ]:
df[['Age', 'Date', 'Gender']]